export default function Footer() {
  return (
    <section>
      <div className="container py-12 flex gap-4 flex-col ">
        <div className="flex gap-4">
          p1
          <div className="size-32 bg-p1c1"></div>
          <div className="size-32 bg-p1c2"></div>
          <div className="size-32 bg-p1c3"></div>
          <div className="size-32 bg-p1c4"></div>
          <div className="size-32 bg-p1c5"></div>
          <div className="size-32 bg-p1c6"></div>
        </div>
        <div className="flex gap-4">
          p2
          <div className="size-32 bg-p2c1"></div>
          <div className="size-32 bg-p2c2"></div>
          <div className="size-32 bg-p2c3"></div>
          <div className="size-32 bg-p2c4"></div>
          <div className="size-32 bg-p2c5"></div>
        </div>
        <div className="p-8 m-4 rounded-lg shadow-lg max-w-screen-lg mx-auto ">
          <h1 className="text-4xl font-bold font-sans mb-4 text-center">
            ברוכים הבאים
          </h1>
          <p className="text-xl mb-4">
            ב החופשית בהיסטוריה עוד. אל בהשחתה טכניים היא. עמוד ראשי קולנוע בה
            זאת, רבה מה יוני צילום מיוחדים, דת לערכים מבוקשים אנציקלופדיה זכר.
            ישראל לעריכה זכר בה. שער ב שמות בגרסה והגולשים, כדי אם יסוד הבקשה,
            צרפתית הספרות אחר גם. בדף רב־לשוני לויקיפדים בהתייחסות של, אל החול
            צרפתית ויקימדיה בקר. גם ספרות איטליה מתמטיקה אנא, יכול בהתייחסות אל
            ארץ, בה טיפול הספרות לויקיפדיה תנך. את שונה נבחרים ואמנות צעד, סדר
            גם ספרות יוצרים, שתי ב והגולשים וספציפיים. זאת של החלה לערך. זכר את
            הרוח לערך והוא, מלא לערך כלשהו אם, שתי או שאלות משפטים ארכיאולוגיה.
            ליום בשפה או סדר.
          </p>
          <ul className="list-disc pl-8 mb-4">
            <li>זהו פריט מספר אחד ברשימה עם אינפורמציה</li>
            <li>זהו פריט מספר שתיים ברשימה עם אינפורמציה</li>
            <li>זהו פריט מספר שלוש ברשימה עם אינפורמציה</li>
            <li>זהו פריט מספר ארבע ברשימה עם אינפורמציה</li>
          </ul>
          <button className="px-6 py-2 bg-blue-600 text-white font-semibold rounded hover:bg-blue-700">
            לחץ עלי
          </button>
        </div>
        <div className="p-8 m-4  rounded-lg shadow-lg max-w-screen-lg mx-auto z-10">
          <h1 className="text-4xl font-bold mb-4 text-center">ברוכים הבאים</h1>
          <p className="text-xl mb-4">
            ב החופשית בהיסטוריה עוד. אל בהשחתה טכניים היא. עמוד ראשי קולנוע בה
            זאת, רבה מה יוני צילום מיוחדים, דת לערכים מבוקשים אנציקלופדיה זכר.
            ישראל לעריכה זכר בה. שער ב שמות בגרסה והגולשים, כדי אם יסוד הבקשה,
            צרפתית הספרות אחר גם. בדף רב־לשוני לויקיפדים בהתייחסות של, אל החול
            צרפתית ויקימדיה בקר. גם ספרות איטליה מתמטיקה אנא, יכול בהתייחסות אל
            ארץ, בה טיפול הספרות לויקיפדיה תנך. את שונה נבחרים ואמנות צעד, סדר
            גם ספרות יוצרים, שתי ב והגולשים וספציפיים. זאת של החלה לערך. זכר את
            הרוח לערך והוא, מלא לערך כלשהו אם, שתי או שאלות משפטים ארכיאולוגיה.
            ליום בשפה או סדר.
          </p>
          <ul className="list-disc pl-8 mb-4">
            <li>זהו פריט מספר אחד ברשימה עם אינפורמציה</li>
            <li>זהו פריט מספר שתיים ברשימה עם אינפורמציה</li>
            <li>זהו פריט מספר שלוש ברשימה עם אינפורמציה</li>
            <li>זהו פריט מספר ארבע ברשימה עם אינפורמציה</li>
          </ul>
          <button className="px-6 py-2 bg-blue-600 text-white font-semibold rounded hover:bg-blue-700">
            לחץ עלי
          </button>
        </div>
        <div className="p-8 m-4  rounded-lg shadow-lg max-w-screen-lg mx-auto z-10">
          <h1 className="text-4xl font-bold mb-4 text-center">ברוכים הבאים</h1>
          <p className="text-xl mb-4">
            ב החופשית בהיסטוריה עוד. אל בהשחתה טכניים היא. עמוד ראשי קולנוע בה
            זאת, רבה מה יוני צילום מיוחדים, דת לערכים מבוקשים אנציקלופדיה זכר.
            ישראל לעריכה זכר בה. שער ב שמות בגרסה והגולשים, כדי אם יסוד הבקשה,
            צרפתית הספרות אחר גם. בדף רב־לשוני לויקיפדים בהתייחסות של, אל החול
            צרפתית ויקימדיה בקר. גם ספרות איטליה מתמטיקה אנא, יכול בהתייחסות אל
            ארץ, בה טיפול הספרות לויקיפדיה תנך. את שונה נבחרים ואמנות צעד, סדר
            גם ספרות יוצרים, שתי ב והגולשים וספציפיים. זאת של החלה לערך. זכר את
            הרוח לערך והוא, מלא לערך כלשהו אם, שתי או שאלות משפטים ארכיאולוגיה.
            ליום בשפה או סדר.
          </p>
          <ul className="list-disc pl-8 mb-4">
            <li>זהו פריט מספר אחד ברשימה עם אינפורמציה</li>
            <li>זהו פריט מספר שתיים ברשימה עם אינפורמציה</li>
            <li>זהו פריט מספר שלוש ברשימה עם אינפורמציה</li>
            <li>זהו פריט מספר ארבע ברשימה עם אינפורמציה</li>
          </ul>
          <button className="px-6 py-2 bg-blue-600 text-white font-semibold rounded hover:bg-blue-700">
            לחץ עלי
          </button>
        </div>{' '}
        <div className="p-8 m-4  rounded-lg shadow-lg max-w-screen-lg mx-auto z-10">
          <h1 className="text-4xl font-bold mb-4 text-center">ברוכים הבאים</h1>
          <p className="text-xl mb-4">
            ב החופשית בהיסטוריה עוד. אל בהשחתה טכניים היא. עמוד ראשי קולנוע בה
            זאת, רבה מה יוני צילום מיוחדים, דת לערכים מבוקשים אנציקלופדיה זכר.
            ישראל לעריכה זכר בה. שער ב שמות בגרסה והגולשים, כדי אם יסוד הבקשה,
            צרפתית הספרות אחר גם. בדף רב־לשוני לויקיפדים בהתייחסות של, אל החול
            צרפתית ויקימדיה בקר. גם ספרות איטליה מתמטיקה אנא, יכול בהתייחסות אל
            ארץ, בה טיפול הספרות לויקיפדיה תנך. את שונה נבחרים ואמנות צעד, סדר
            גם ספרות יוצרים, שתי ב והגולשים וספציפיים. זאת של החלה לערך. זכר את
            הרוח לערך והוא, מלא לערך כלשהו אם, שתי או שאלות משפטים ארכיאולוגיה.
            ליום בשפה או סדר.
          </p>
          <ul className="list-disc pl-8 mb-4">
            <li>זהו פריט מספר אחד ברשימה עם אינפורמציה</li>
            <li>זהו פריט מספר שתיים ברשימה עם אינפורמציה</li>
            <li>זהו פריט מספר שלוש ברשימה עם אינפורמציה</li>
            <li>זהו פריט מספר ארבע ברשימה עם אינפורמציה</li>
          </ul>
          <button className="px-6 py-2 bg-blue-600 text-white font-semibold rounded hover:bg-blue-700">
            לחץ עלי
          </button>
        </div>
      </div>
    </section>
  )
}
